# Задайте последовательность чисел.
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

list_1 =[1, 4, 5, 4, 4, 4, 4, 5, 5, 6,8,8,9,6,4,324,54,5,7,57,4,3,5,6,6,6,6,45,4]
MySet=set(list_1)
print(MySet)